bookstore/app/Models/ModelBook.php

SELECT *
FROM `buku`
JOIN `penerbit` ON `buku`.`id_penerbit` = `penerbit`.`id_penerbit`
---
    public function getAllData()
    {
        return $this->join('penerbit', 'buku.id_penerbit = penerbit.id_penerbit')->findAll();

SELECT `nama_buku`, `stok`, `penerbit`.`nama` as `nama_penerbit`
FROM `buku`
JOIN `penerbit` ON `buku`.`id_penerbit` = `penerbit`.`id_penerbit`
WHERE `stok` <= 5
---
    public function getBooksLowStock()
    {
        // Get books with low stock
        return $this->select('nama_buku, stok, penerbit.nama as nama_penerbit')
            ->join('penerbit', 'buku.id_penerbit = penerbit.id_penerbit')
            ->where('stok <=', 5) // Set the threshold for low stock
            ->findAll();